app/controllers/daily_snaps_controller.rb

    def create
        @daily_snap = DailySnap.new(daily_snap_params)
        if @daily_snap.save!
---
INSERT INTO "daily_snaps" ("user_id", "steps", "weight", "height", "bmi", "pbf", "img", "calories", "protein", "carbs", "fat", "sugar", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

    def update
        @daily_snap = DailySnap.find(params[:id])
        if @daily_snap.update(daily_snap_params)
---
SELECT  "daily_snaps".* FROM "daily_snaps" WHERE "daily_snaps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "daily_snaps" SET "weight" = $1, "calories" = $2, "protein" = $3, "carbs" = $4, "fat" = $5, "sugar" = $6, "updated_at" = $7 WHERE "daily_snaps"."id" = $8  [["weight", "350.0"], ["calories", 240], ["protein", 23], ["carbs", 55], ["fat", 20], ["sugar", 25], ["updated_at", "2019-06-05 21:54:52.401157"], ["id", 1]]