app/controllers/meals_controller.rb

INSERT INTO "meals" ("user_id", "name", "date", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["name", "Kale Salad2"], ["date", "2019-06-11"], ["time", "2019-06-11 10:19:36"], ["created_at", "2019-06-11 14:27:43.596274"], ["updated_at", "2019-06-11 14:27:43.596274"]]
---
    def create
        @meal = Meal.new(meal_params)
        if @meal.save!

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "meals" SET "meal_type" = $1, "time" = $2, "updated_at" = $3 WHERE "meals"."id" = $4  [["meal_type", "Dinner"], ["time", "2019-06-05 12:00:00"], ["updated_at", "2019-06-05 21:55:08.442413"], ["id", 1]]
---
    def update
        @meal = Meal.find(params[:id])
        if @meal.update(meal_params)

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
DELETE FROM "meals" WHERE "meals"."id" = $1  [["id", 40]]
---
    def destroy
        @meal = Meal.find(params[:id])
        @meal.destroy