app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "email", "name", "description", "gender", "age", "years_exp", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "$2a$12$PfYkHuWdq.ybewj2KKan6uRwhCch0gXmzlIDuAtWCuiyequO9wTHq"], ["name", "John Cho the \"BEAST\""], ["updated_at", "2019-06-18 16:39:33.954045"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)