app/controllers/user_settings_controller.rb

INSERT INTO "user_settings" ("user_id", "set_calories", "set_steps", "set_protein_percent", "set_carb_percent", "set_protein_amount", "set_carb_amount", "set_fat_amount", "set_sugar_amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def create
        @user_setting = UserSetting.new(user_setting_params)
        if @user_setting.save!

SELECT  "user_settings".* FROM "user_settings" WHERE "user_settings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "user_settings" SET "set_calories" = $1, "set_protein_amount" = $2, "set_carb_amount" = $3, "set_fat_amount" = $4, "updated_at" = $5 WHERE "user_settings"."id" = $6  [["set_calories", 0], ["set_protein_amount", 0], ["set_carb_amount", 0], ["set_fat_amount", 0], ["updated_at", "2019-06-20 14:04:01.761969"], ["id", 1]]
---
    def update
        @user_setting = UserSetting.find(params[:id])
        if @user_setting.update(user_setting_params)