app/controllers/user_workouts_controller.rb

    def show
        @user_workout = UserWorkout.find(params[:id])
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @user_workout = UserWorkout.new(user_workout_params)
        if @user_workout.save!
---
INSERT INTO "user_workouts" ("user_id", "workout_id", "created_at", "updated_at", "sets", "reps", "workout_type") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["workout_id", 1], ["created_at", "2019-06-14 22:24:49.612423"], ["updated_at", "2019-06-14 22:24:49.612423"], ["sets", 4], ["reps", 4], ["workout_type", "Chest"]]

    def destroy
        @user_workout = UserWorkout.find(params[:id])
        @user_workout.destroy
---
SELECT  "user_workouts".* FROM "user_workouts" WHERE "user_workouts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "user_workouts" WHERE "user_workouts"."id" = $1  [["id", 7]]