app/controllers/workouts_controller.rb

    def create
        @workout = Workout.new(workout_params)
        if @workout.save!
---
INSERT INTO "workouts" ("name", "description", "sets", "reps", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Barbell Row"], ["description", "blah blah"], ["sets", 3], ["reps", 15], ["created_at", "2019-06-05 22:06:55.018938"], ["updated_at", "2019-06-05 22:06:55.018938"]]

    def update
        @workout = Workout.find(params[:id])
        if @workout.update(workout_params)
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "workouts" SET "sets" = $1, "updated_at" = $2 WHERE "workouts"."id" = $3  [["sets", 5], ["updated_at", "2019-06-05 22:07:29.723771"], ["id", 1]]

    def destroy
        @workout = Workout.find(params[:id])
---
SELECT  "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]